; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v3 ?v6)
             (pred_12 ?v13 ?v7)
             (pred_3 ?v3 ?v7)
             (pred_4 ?v4 ?v3 )
	     (pred_6 ?v3)
             (pred_2 ?v12)
             (pred_1 ?v13)
             (pred_11 ?v7)
             (pred_10 ?v3)
             (pred_8 ?v13)
             (pred_7 ?v3)
             (pred_5 ))



(:action op_3
:parameters (?v8 ?v11 ?v10 ?v5)
:precondition (and (pred_2 ?v8) (pred_2 ?v11) (pred_1 ?v10) (pred_11 ?v5)
          (pred_9 ?v8 ?v11) (pred_12 ?v10 ?v5)
                   (pred_3 ?v11 ?v5) (pred_6 ?v8) 
                   (pred_10 ?v11) (pred_8 ?v10))
:effect (and  (pred_7 ?v11) (not (pred_10 ?v11))))


(:action op_4
:parameters (?v8 ?v1)
:precondition (and (pred_2 ?v8) (pred_2 ?v1)
               (pred_6 ?v8) (pred_9 ?v8 ?v1) (pred_7 ?v1))
:effect (and (pred_6 ?v1) (not (pred_6 ?v8))))

(:action op_1
:parameters (?v8 ?v10)
:precondition (and (pred_2 ?v8) (pred_1 ?v10) 
                  (pred_6 ?v8) (pred_4 ?v10 ?v8) (pred_5 ))
:effect (and (pred_8 ?v10)
   (not (pred_4 ?v10 ?v8)) (not (pred_5 ))))


(:action op_2
:parameters (?v8 ?v9 ?v2)
:precondition (and (pred_2 ?v8) (pred_1 ?v9) (pred_1 ?v2)
                  (pred_6 ?v8) (pred_8 ?v2) (pred_4 ?v9 ?v8))
:effect (and (pred_8 ?v9) (pred_4 ?v2 ?v8)
        (not (pred_8 ?v2)) (not (pred_4 ?v9 ?v8))))

(:action op_5
:parameters (?v8 ?v10)
:precondition (and (pred_2 ?v8) (pred_1 ?v10) 
                  (pred_6 ?v8) (pred_8 ?v10))
:effect (and (pred_5 ) (pred_4 ?v10 ?v8) (not (pred_8 ?v10)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_03 obj_04 obj_02 obj_09 obj_06 obj_05 obj_13 obj_07
    obj_10 obj_11
    obj_08 obj_12
    )

    (:init
       (pred_5)

       (pred_2 obj_01)
       (pred_2 obj_03)
       (pred_2 obj_04)
       (pred_2 obj_02)
       (pred_2 obj_09)
       (pred_2 obj_06)
       (pred_2 obj_05)
       (pred_2 obj_13)
       (pred_2 obj_07)
       (pred_11 obj_10)
       (pred_11 obj_11)
       (pred_1 obj_08)
       (pred_1 obj_12)

       (pred_9 obj_01 obj_02)
       (pred_9 obj_01 obj_03)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_03 obj_04)
       (pred_9 obj_03 obj_01)
       (pred_9 obj_04 obj_06)
       (pred_9 obj_04 obj_03)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_02 obj_09)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_09 obj_13)
       (pred_9 obj_09 obj_06)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_06 obj_07)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_06 obj_09)
       (pred_9 obj_05 obj_13)
       (pred_9 obj_05 obj_02)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_13 obj_09)
       (pred_9 obj_13 obj_05)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_07 obj_13)
       (pred_10 obj_05)
       (pred_10 obj_01)
       (pred_3  obj_05 obj_10)
       (pred_3  obj_01 obj_11)
       (pred_7 obj_03)
       (pred_7 obj_04)
       (pred_7 obj_02)
       (pred_7 obj_09)
       (pred_7 obj_06)
       (pred_7 obj_13)
       (pred_7 obj_07)

       (pred_12  obj_08 obj_10)
       (pred_12  obj_12 obj_11)
       (pred_4 obj_08 obj_04)
       (pred_4 obj_12 obj_04)
       (pred_6 obj_13)
    )

    (:goal (and
       (pred_4 obj_08 obj_03)
    ))
(:constraints
  (always (not (pred_6 obj_09)))
)
)

; plan
1. (op_4 obj_13 obj_07)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_07)
   goals met: 0 of 1
2. (op_4 obj_07 obj_06)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_06)
   goals met: 0 of 1
3. (op_4 obj_06 obj_04)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_04)
   goals met: 0 of 1
4. (op_1 obj_04 obj_08)
   deleted: (pred_4 obj_08 obj_04) (pred_5)
   added: (pred_8 obj_08)
   goals met: 0 of 1
5. (op_4 obj_04 obj_03)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_03)
   goals met: 0 of 1
6. (op_5 obj_03 obj_08)
   deleted: (pred_8 obj_08)
   added: (pred_5) (pred_4 obj_08 obj_03)
   goals met: 1 of 1
